
tap 'caskroom/cask'

brew 'readline'
brew 'openssl', state: 'linked', install_options: true
brew 'git'
brew 'peco'
brew 'nvm'
brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-bundler'
brew 'python3'
brew 'vim'
brew 'macvim'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'ack'
brew 'binutils'
brew 'autoconf'
brew 'gnu-sed'
brew 'w3m'
brew 'wget'
brew 'awscli'
brew 'go'
brew 'ag'
brew 'pwgen'
brew 'imagemagick'
brew 'ghq'
brew 'x265'
brew 'lv'
brew 'ffmpeg', args: %w(
  with-fdk-aac with-ffplay with-freetype
  with-libass with-libquvi with-libvorbis with-libvpx with-opus
  with-x265 with-webp with-rtmpdump
)

tap 'mpv-player/mpv'
brew 'mpv', args: %w(
  with-bundle HEAD
)
#brew 'mysql'
#brew 'postgresql'
#brew 'qt4'
#brew 'memcached'
#brew 'cmake'
#brew 'casperjs'

cask 'google-chrome'
cask 'google-japanese-ime'
cask 'iterm2'
cask 'slack'
cask 'vagrant'
cask 'virtualbox'
cask 'dropbox'
cask 'xld'
cask 'skitch'
cask 'sourcetree'
cask 'evernote'
cask 'steam'
cask 'docker'
cask 'google-cloud-sdk'
cask 'adobe-reader'
cask 'burn'
cask 'firefox'
#cask 'XX'
